## Plan Result (dev-uksouth-dev)




<pre><code>Plan: 55 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.dev-platform.azurerm_private_dns_a_record.this[&#34;hmi-pact&#34;]
  * module.dev-platform.azurerm_private_dns_a_record.this[&#34;hmi-wiremock&#34;]
  * module.dev-platform.azurerm_private_dns_a_record.this[&#34;sds-alertmanager-00&#34;]
  * module.dev-platform.azurerm_private_dns_a_record.this[&#34;sds-alertmanager-01&#34;]
  * module.dev-platform.azurerm_private_dns_a_record.this[&#34;sds-api-mgmt&#34;]
  * module.dev-platform.azurerm_private_dns_a_record.this[&#34;sds-prometheus-00&#34;]
  * module.dev-platform.azurerm_private_dns_a_record.this[&#34;sds-prometheus-01&#34;]
  * module.dev-platform.azurerm_private_dns_a_record.this[&#34;traefik-sds-00&#34;]
  * module.dev-platform.azurerm_private_dns_a_record.this[&#34;traefik-sds-01&#34;]
  * module.dev-platform.azurerm_private_dns_a_record.this[&#34;vh-wowza&#34;]
  * module.dev-platform.azurerm_private_dns_cname_record.this[&#34;hmi-apim&#34;]
  * module.dev-platform.azurerm_private_dns_cname_record.this[&#34;jdbureau&#34;]
  * module.dev-platform.azurerm_private_dns_cname_record.this[&#34;jdfrontend&#34;]
  * module.dev-platform.azurerm_private_dns_cname_record.this[&#34;sds-neuvector00&#34;]
  * module.dev-platform.azurerm_private_dns_cname_record.this[&#34;sds-neuvector00-api&#34;]
  * module.dev-platform.azurerm_private_dns_cname_record.this[&#34;sds-neuvector01&#34;]
  * module.dev-platform.azurerm_private_dns_cname_record.this[&#34;sds-neuvector01-api&#34;]
  * module.dev-platform.azurerm_private_dns_cname_record.this[&#34;toffee&#34;]
  * module.dev-platform.azurerm_private_dns_zone.zone[0]
  * module.dev-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-nonprod-vnet&#34;]
  * module.dev-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.dev-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;hmi-sharedinfra-vnet-dev&#34;]
  * module.dev-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.dom1-infra-int.azurerm_private_dns_a_record.this[&#34;juror-api&#34;]
  * module.dom1-infra-int.azurerm_private_dns_a_record.this[&#34;juror-api-nle&#34;]
  * module.dom1-infra-int.azurerm_private_dns_zone.zone[0]
  * module.dom1-infra-int.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-nonprod-vnet&#34;]
  * module.dom1-infra-int.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.dom1-infra-int.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.preview-idam-internal.azurerm_private_dns_zone.zone[0]
  * module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-nonprod-vnet&#34;]
  * module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-aat-internal&#34;]
  * module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-aat-internal&#34;]
  * module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-aat2-internal&#34;]
  * module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-preview-internal&#34;]
  * module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-preview-internal&#34;]
  * module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;mgmt-infra-prod&#34;]
  * module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.preview-internal.azurerm_private_dns_zone.zone[0]
  * module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-nonprod-vnet&#34;]
  * module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-aat-internal&#34;]
  * module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-aat-internal&#34;]
  * module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-aat2-internal&#34;]
  * module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-preview-internal&#34;]
  * module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-preview-internal&#34;]
  * module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;mgmt-infra-prod&#34;]
  * module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]
  * module.preview-platform.azurerm_private_dns_zone.zone[0]
  * module.preview-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;bastion-nonprod-vnet&#34;]
  * module.preview-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-idam-preview-internal&#34;]
  * module.preview-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-mgmt&#34;]
  * module.preview-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;core-infra-vnet-preview-internal&#34;]
  * module.preview-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link[&#34;reform-mgmt-core-vnet&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.dev-platform.azurerm_private_dns_a_record.this["hmi-pact"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "hmi-pact"
      + records             = [
          + "10.145.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_a_record.this["hmi-wiremock"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "hmi-wiremock"
      + records             = [
          + "10.145.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_a_record.this["sds-alertmanager-00"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-alertmanager-00"
      + records             = [
          + "10.145.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_a_record.this["sds-alertmanager-01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-alertmanager-01"
      + records             = [
          + "10.145.31.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_a_record.this["sds-api-mgmt"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-api-mgmt"
      + records             = [
          + "10.145.33.133",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_a_record.this["sds-prometheus-00"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-prometheus-00"
      + records             = [
          + "10.145.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_a_record.this["sds-prometheus-01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-prometheus-01"
      + records             = [
          + "10.145.31.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_a_record.this["traefik-sds-00"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "traefik-sds-00"
      + records             = [
          + "10.145.15.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_a_record.this["traefik-sds-01"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "traefik-sds-01"
      + records             = [
          + "10.145.31.250",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_a_record.this["vh-wowza"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "vh-wowza"
      + records             = [
          + "10.100.198.69",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_cname_record.this["hmi-apim"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "hmi-apim"
      + record              = "hmcts-dev.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_cname_record.this["jdbureau"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "jdbureau"
      + record              = "sdshmcts-dev.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_cname_record.this["jdfrontend"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "jdfrontend"
      + record              = "sdshmcts-dev.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_cname_record.this["sds-neuvector00"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-neuvector00"
      + record              = "traefik-sds-00.dev.platform.hmcts.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_cname_record.this["sds-neuvector00-api"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-neuvector00-api"
      + record              = "traefik-sds-00.dev.platform.hmcts.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_cname_record.this["sds-neuvector01"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-neuvector01"
      + record              = "traefik-sds-01.dev.platform.hmcts.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_cname_record.this["sds-neuvector01-api"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "sds-neuvector01-api"
      + record              = "traefik-sds-01.dev.platform.hmcts.net"
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_cname_record.this["toffee"] will be created
  + resource "azurerm_private_dns_cname_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "toffee"
      + record              = "sdshmcts-dev.azurefd.net."
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dev.platform.hmcts.net"
    }

  # module.dev-platform.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "dev.platform.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.dev-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-nonprod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-nonprod-vnet"
      + private_dns_zone_name = "dev.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet"
    }

  # module.dev-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "dev.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.dev-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["hmi-sharedinfra-vnet-dev"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "hmi-sharedinfra-vnet-dev"
      + private_dns_zone_name = "dev.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/hmi-sharedinfra-dev-rg/providers/Microsoft.Network/virtualNetworks/hmi-sharedinfra-vnet-dev"
    }

  # module.dev-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "dev.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

  # module.dom1-infra-int.azurerm_private_dns_a_record.this["juror-api"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "juror-api"
      + records             = [
          + "10.100.197.186",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dom1.infra.int"
    }

  # module.dom1-infra-int.azurerm_private_dns_a_record.this["juror-api-nle"] will be created
  + resource "azurerm_private_dns_a_record" "this" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "juror-api-nle"
      + records             = [
          + "10.72.1.211",
        ]
      + resource_group_name = "core-infra-intsvc-rg"
      + ttl                 = 300
      + zone_name           = "dom1.infra.int"
    }

  # module.dom1-infra-int.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "dom1.infra.int"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.dom1-infra-int.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-nonprod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-nonprod-vnet"
      + private_dns_zone_name = "dom1.infra.int"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet"
    }

  # module.dom1-infra-int.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "dom1.infra.int"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.dom1-infra-int.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "dom1.infra.int"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

  # module.preview-idam-internal.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "service.core-compute-idam-preview.internal"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-nonprod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-nonprod-vnet"
      + private_dns_zone_name = "service.core-compute-idam-preview.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet"
    }

  # module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-aat-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-aat-internal"
      + private_dns_zone_name = "service.core-compute-idam-preview.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat"
    }

  # module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-aat-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-aat-internal"
      + private_dns_zone_name = "service.core-compute-idam-preview.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat"
    }

  # module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-aat2-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-aat2-internal"
      + private_dns_zone_name = "service.core-compute-idam-preview.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat2"
    }

  # module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-preview-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-preview-internal"
      + private_dns_zone_name = "service.core-compute-idam-preview.internal"
      + registration_enabled  = true
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-preview/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-preview"
    }

  # module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "service.core-compute-idam-preview.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-preview-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-preview-internal"
      + private_dns_zone_name = "service.core-compute-idam-preview.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-preview/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-preview"
    }

  # module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["mgmt-infra-prod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "mgmt-infra-prod"
      + private_dns_zone_name = "service.core-compute-idam-preview.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/mgmt-infra-prod/providers/Microsoft.Network/virtualNetworks/mgmt-infra-prod"
    }

  # module.preview-idam-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "service.core-compute-idam-preview.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

  # module.preview-internal.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "service.core-compute-preview.internal"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-nonprod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-nonprod-vnet"
      + private_dns_zone_name = "service.core-compute-preview.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet"
    }

  # module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-aat-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-aat-internal"
      + private_dns_zone_name = "service.core-compute-preview.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat"
    }

  # module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-aat-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-aat-internal"
      + private_dns_zone_name = "service.core-compute-preview.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat"
    }

  # module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-aat2-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-aat2-internal"
      + private_dns_zone_name = "service.core-compute-preview.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-aat2/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-aat2"
    }

  # module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-preview-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-preview-internal"
      + private_dns_zone_name = "service.core-compute-preview.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-preview/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-preview"
    }

  # module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "service.core-compute-preview.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-preview-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-preview-internal"
      + private_dns_zone_name = "service.core-compute-preview.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-preview/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-preview"
    }

  # module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["mgmt-infra-prod"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "mgmt-infra-prod"
      + private_dns_zone_name = "service.core-compute-preview.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/mgmt-infra-prod/providers/Microsoft.Network/virtualNetworks/mgmt-infra-prod"
    }

  # module.preview-internal.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "service.core-compute-preview.internal"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

  # module.preview-platform.azurerm_private_dns_zone.zone[0] will be created
  + resource "azurerm_private_dns_zone" "zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "preview.platform.hmcts.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "core-infra-intsvc-rg"
      + tags                                                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }

      + soa_record {
          + email         = (known after apply)
          + expire_time   = (known after apply)
          + fqdn          = (known after apply)
          + host_name     = (known after apply)
          + minimum_ttl   = (known after apply)
          + refresh_time  = (known after apply)
          + retry_time    = (known after apply)
          + serial_number = (known after apply)
          + tags          = (known after apply)
          + ttl           = (known after apply)
        }
    }

  # module.preview-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["bastion-nonprod-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "bastion-nonprod-vnet"
      + private_dns_zone_name = "preview.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/b44eb479-9ae2-42e7-9c63-f3c599719b6f/resourceGroups/bastion-nonprod-rg/providers/Microsoft.Network/virtualNetworks/bastion-nonprod-vnet"
    }

  # module.preview-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-idam-preview-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-idam-preview-internal"
      + private_dns_zone_name = "preview.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-idam-preview/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-idam-preview"
    }

  # module.preview-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-mgmt"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-mgmt"
      + private_dns_zone_name = "preview.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/rg-mgmt/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-mgmt"
    }

  # module.preview-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["core-infra-vnet-preview-internal"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "core-infra-vnet-preview-internal"
      + private_dns_zone_name = "preview.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-preview/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-preview"
    }

  # module.preview-platform.azurerm_private_dns_zone_virtual_network_link.vnet_link["reform-mgmt-core-vnet"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnet_link" {
      + id                    = (known after apply)
      + name                  = "reform-mgmt-core-vnet"
      + private_dns_zone_name = "preview.platform.hmcts.net"
      + registration_enabled  = false
      + resource_group_name   = "core-infra-intsvc-rg"
      + tags                  = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-private-dns"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "development"
        }
      + virtual_network_id    = "/subscriptions/ed302caf-ec27-4c64-a05e-85731c3ce90e/resourceGroups/reformMgmtCoreRG/providers/Microsoft.Network/virtualNetworks/reformMgmtCoreVNet"
    }

Plan: 55 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":420,"Program":"tfcmt","SHA1":"","Target":"dev-uksouth-dev","Vars":{}} -->